Catalogs/СобственныеСклады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СобственныеСклады</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресВебСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВэбСервисУТ11</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейВПути</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаЧерезСкладТомилино</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьИзОбщегоЭкспресса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПоставщикаДляСтатусовНаПортале</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьНоменклатуруВМДМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьСчетФактуруПриПроведенииПТУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГрузоотправителяУТ11</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуетОбособленнуюОтгрузку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМДМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВебСервисаCreateVarianceAct</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВебСервисаUpdateVarianceAct</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьПоступленияЧерезЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСервисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/РазмещениеПоЯчейкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РазмещениеПоЯчейкам</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтПокупателя</xr:Item>
				<xr:Item>Document.ОприходованиеТоваров</xr:Item>
				<xr:Item>Document.КорректировкаРеализации</xr:Item>
				<xr:Item>Document.ПересортицаТоваров</xr:Item>
				<xr:Item>Document.ЗаданиеНаИнвентаризацию</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровНаОтветственноеХранение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПалетноеХранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПослеПриемки</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровНаОтветственноеХранение</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаИнвентаризацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроверять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСкладскогоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клеверенс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УжеРазмещены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВведеноВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГМ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/СобственныеСклады/Ext/ManagerModule.bsl
Функция IDСоответстуетОбособленнойОтгрузке(IDСклада) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобственныеСклады.Ссылка
	|ИЗ
	|	Справочник.СобственныеСклады КАК СобственныеСклады
	|ГДЕ
	|	СобственныеСклады.Идентификатор = &Идентификатор
	|	И СобственныеСклады.ИсключитьИзОбщегоЭкспресса
	|	И НЕ СобственныеСклады.ВэбСервисУТ11 
	|	И НЕ СобственныеСклады.НеИспользуетОбособленнуюОтгрузку";

	Запрос.УстановитьПараметр("Идентификатор", IDСклада);  
	
	Выборка = Запрос.Выполнить().Выбрать();   
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;				
	КонецЕсли;         
	
	Возврат Ложь;
	
КонецФункции  

Функция IDСоответстуетИсключительномуСкладу(IDСклада) Экспорт
//+Гавриленков В. 23.11.2024 #UT10-4934
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобственныеСклады.Ссылка
	|ИЗ
	|	Справочник.СобственныеСклады КАК СобственныеСклады
	|ГДЕ
	|	СобственныеСклады.Идентификатор = &Идентификатор
	|	И СобственныеСклады.ИсключитьИзОбщегоЭкспресса
	|	И НЕ СобственныеСклады.ВэбСервисУТ11";
	
	Запрос.УстановитьПараметр("Идентификатор", IDСклада);  
	
	Выборка = Запрос.Выполнить().Выбрать();   
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;				
	КонецЕсли;         
	
	Возврат Ложь;
	
//-Гавриленков В. 23.11.2024 #UT10-4934
КонецФункции

Функция ПолучитьМассивГрузоместПоЗаказу(Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.ГМ,
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|ПОМЕСТИТЬ ВТ_ГМПоступлений
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Заказ = &Заказ
	|	И ПоступлениеТоваровУслугТовары.ГМ <> """"
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.ГМ,
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеПоЯчейкамТовары.ГМ
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГМПоступлений КАК ВТ_ГМПоступлений
	|		ПО РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование = ВТ_ГМПоступлений.Ссылка
	|			И РазмещениеПоЯчейкамТовары.ГМ = ВТ_ГМПоступлений.ГМ
	|ГДЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеПоЯчейкамТовары.ГМ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);  
	
	МассивВозврата = Новый Массив;	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивВозврата.Добавить(Выборка.ГМ);
	КонецЦикла;  
	
	Возврат МассивВозврата;
	
КонецФункции

Функция ПолучитьСобственныйСкладПоИдентификатору(ИдентификаторСклада) Экспорт
	
	//+Макрушин Е. 12.02.2026 #UT10-5665
	РезультатСклад = Справочники.СобственныеСклады.ПустаяСсылка();
	
	Если ИдентификаторСклада = 0 Тогда 
		Возврат РезультатСклад;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобственныеСклады.Ссылка КАК Ссылка,
	|	СобственныеСклады.Идентификатор
	|ИЗ
	|	Справочник.СобственныеСклады КАК СобственныеСклады
	|ГДЕ
	|	СобственныеСклады.Идентификатор = &Идентификатор
	|	И НЕ СобственныеСклады.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторСклада);	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий()  Тогда
		РезультатСклад = Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат РезультатСклад;
	//-Макрушин Е. 12.02.2026 #UT10-5665
	
КонецФункции
